douggilliland/Retro-Computers/Z80/PSOC/PSOC_Design_Files/Workspace01/Z80_3Pin.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CPUD0_aliases.h"
#include "CPUD0.h"
#include "CPUD1_aliases.h"
#include "CPUD1.h"
#include "CPUD2_aliases.h"
#include "CPUD2.h"
#include "CPUD3_aliases.h"
#include "CPUD3.h"
#include "CPUD4_aliases.h"
#include "CPUD4.h"
#include "CPUD5_aliases.h"
#include "CPUD5.h"
#include "CPUD6_aliases.h"
#include "CPUD6.h"
#include "CPUD7_aliases.h"
#include "CPUD7.h"
#include "Control_Reg_1.h"
#include "Status_Reg_1.h"
#include "Clock_1.h"
#include "IORQ_n_aliases.h"
#include "IORQ_n.h"
#include "CPURD_n_aliases.h"
#include "CPURD_n.h"
#include "AdrLowIn.h"
#include "CPUA0_aliases.h"
#include "CPUA0.h"
#include "CPUA1_aliases.h"
#include "CPUA1.h"
#include "CPUA2_aliases.h"
#include "CPUA2.h"
#include "CPUA3_aliases.h"
#include "CPUA3.h"
#include "CPUA4_aliases.h"
#include "CPUA4.h"
#include "CPUA5_aliases.h"
#include "CPUA5.h"
#include "CPUA6_aliases.h"
#include "CPUA6.h"
#include "CPUA7_aliases.h"
#include "CPUA7.h"
#include "AdrLowOut.h"
#include "MemCtlReg.h"
#include "WAIT_n_aliases.h"
#include "WAIT_n.h"
#include "Status_Reg_2.h"
#include "USBUART_1.h"
#include "USBUART_1_audio.h"
#include "USBUART_1_cdc.h"
#include "USBUART_1_hid.h"
#include "USBUART_1_midi.h"
#include "USBUART_1_pvt.h"
#include "USBUART_1_cydmac.h"
#include "USBUART_1_msc.h"
#include "UART_1.h"
#include "CTS_n_aliases.h"
#include "CTS_n.h"
#include "RTS_n_aliases.h"
#include "RTS_n.h"
#include "CPUWR_n_aliases.h"
#include "CPUWR_n.h"
#include "TOP_ADDR_REG.h"
#include "CPUA13_aliases.h"
#include "CPUA13.h"
#include "CPUA14_aliases.h"
#include "CPUA14.h"
#include "CPUA15_aliases.h"
#include "CPUA15.h"
#include "SRAMA13_aliases.h"
#include "SRAMA13.h"
#include "SRAMA14_aliases.h"
#include "SRAMA14.h"
#include "SRAMA15_aliases.h"
#include "SRAMA15.h"
#include "SRAMA16_aliases.h"
#include "SRAMA16.h"
#include "SRAMA17_aliases.h"
#include "SRAMA17.h"
#include "SRAMA18_aliases.h"
#include "SRAMA18.h"
#include "CPUA8_aliases.h"
#include "CPUA8.h"
#include "CPUA9_aliases.h"
#include "CPUA9.h"
#include "CPUA10_aliases.h"
#include "CPUA10.h"
#include "CPUA11_aliases.h"
#include "CPUA11.h"
#include "CPUA12_aliases.h"
#include "CPUA12.h"
#include "MID_ADDR_REG.h"
#include "LED_aliases.h"
#include "LED.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "Clock_2.h"
#include "MREQ_n_aliases.h"
#include "MREQ_n.h"
#include "I2C_1.h"
#include "I2C_1_PVT.h"
#include "BUSRQ_n_aliases.h"
#include "BUSRQ_n.h"
#include "MEMWR_n_aliases.h"
#include "MEMWR_n.h"
#include "MEMRD_n_aliases.h"
#include "MEMRD_n.h"
#include "M1_n_aliases.h"
#include "M1_n.h"
#include "INT_n_aliases.h"
#include "INT_n.h"
#include "NMI_n_aliases.h"
#include "NMI_n.h"
#include "HALT_n_aliases.h"
#include "HALT_n.h"
#include "SRAMCS_n_aliases.h"
#include "SRAMCS_n.h"
#include "USBUART_1_Dm_aliases.h"
#include "USBUART_1_Dm.h"
#include "USBUART_1_Dp_aliases.h"
#include "USBUART_1_Dp.h"
#include "UART_1_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

